Revit 2027 API
ParameterTypeId.GroupAllowedViewTypes Property
 "Allowed View Types"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId GroupAllowedViewTypes { get; }
Public Shared ReadOnly Property GroupAllowedViewTypes As ForgeTypeId
	Get
public:
static property ForgeTypeId^ GroupAllowedViewTypes {
	ForgeTypeId^ get ();
}
static member GroupAllowedViewTypes : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace